; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v10 ?v8)
             (pred_1 ?v2 ?v12)
             (pred_6 ?v10 ?v12)
             (pred_3 ?v1 ?v10 )
	     (pred_2 ?v10)
             (pred_12 ?v6)
             (pred_11 ?v2)
             (pred_9 ?v12)
             (pred_4 ?v10)
             (pred_7 ?v2)
             (pred_10 ?v10)
             (pred_8 ))



(:action op_3
:parameters (?v9 ?v11 ?v3 ?v7)
:precondition (and (pred_12 ?v9) (pred_12 ?v11) (pred_11 ?v3) (pred_9 ?v7)
          (pred_5 ?v9 ?v11) (pred_1 ?v3 ?v7)
                   (pred_6 ?v11 ?v7) (pred_2 ?v9) 
                   (pred_4 ?v11) (pred_7 ?v3))
:effect (and  (pred_10 ?v11) (not (pred_4 ?v11))))


(:action op_5
:parameters (?v9 ?v5)
:precondition (and (pred_12 ?v9) (pred_12 ?v5)
               (pred_2 ?v9) (pred_5 ?v9 ?v5) (pred_10 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v9))))

(:action op_1
:parameters (?v9 ?v3)
:precondition (and (pred_12 ?v9) (pred_11 ?v3) 
                  (pred_2 ?v9) (pred_3 ?v3 ?v9) (pred_8 ))
:effect (and (pred_7 ?v3)
   (not (pred_3 ?v3 ?v9)) (not (pred_8 ))))


(:action op_2
:parameters (?v9 ?v13 ?v4)
:precondition (and (pred_12 ?v9) (pred_11 ?v13) (pred_11 ?v4)
                  (pred_2 ?v9) (pred_7 ?v4) (pred_3 ?v13 ?v9))
:effect (and (pred_7 ?v13) (pred_3 ?v4 ?v9)
        (not (pred_7 ?v4)) (not (pred_3 ?v13 ?v9))))

(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_12 ?v9) (pred_11 ?v3) 
                  (pred_2 ?v9) (pred_7 ?v3))
:effect (and (pred_8 ) (pred_3 ?v3 ?v9) (not (pred_7 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_30 obj_14 obj_20 obj_17 obj_22 obj_27 obj_05 obj_09 obj_03 obj_06 obj_26 obj_24 obj_28 obj_29 obj_25 obj_12 obj_02 obj_16 obj_18 obj_04 obj_13 obj_19 obj_07 obj_15
    obj_08 obj_21
    obj_23 obj_01 obj_10
    )

    (:init
       (pred_8)

       (pred_12 obj_11)
       (pred_12 obj_30)
       (pred_12 obj_14)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_22)
       (pred_12 obj_27)
       (pred_12 obj_05)
       (pred_12 obj_09)
       (pred_12 obj_03)
       (pred_12 obj_06)
       (pred_12 obj_26)
       (pred_12 obj_24)
       (pred_12 obj_28)
       (pred_12 obj_29)
       (pred_12 obj_25)
       (pred_12 obj_12)
       (pred_12 obj_02)
       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_12 obj_04)
       (pred_12 obj_13)
       (pred_12 obj_19)
       (pred_12 obj_07)
       (pred_12 obj_15)
       (pred_9 obj_08)
       (pred_9 obj_21)
       (pred_11 obj_23)
       (pred_11 obj_01)
       (pred_11 obj_10)

       (pred_5 obj_11 obj_22)
       (pred_5 obj_11 obj_30)
       (pred_5 obj_30 obj_27)
       (pred_5 obj_30 obj_14)
       (pred_5 obj_30 obj_11)
       (pred_5 obj_14 obj_05)
       (pred_5 obj_14 obj_20)
       (pred_5 obj_14 obj_30)
       (pred_5 obj_20 obj_09)
       (pred_5 obj_20 obj_17)
       (pred_5 obj_20 obj_14)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_17 obj_20)
       (pred_5 obj_22 obj_06)
       (pred_5 obj_22 obj_27)
       (pred_5 obj_22 obj_11)
       (pred_5 obj_27 obj_26)
       (pred_5 obj_27 obj_05)
       (pred_5 obj_27 obj_30)
       (pred_5 obj_27 obj_22)
       (pred_5 obj_05 obj_24)
       (pred_5 obj_05 obj_09)
       (pred_5 obj_05 obj_14)
       (pred_5 obj_05 obj_27)
       (pred_5 obj_09 obj_28)
       (pred_5 obj_09 obj_03)
       (pred_5 obj_09 obj_20)
       (pred_5 obj_09 obj_05)
       (pred_5 obj_03 obj_29)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_06 obj_25)
       (pred_5 obj_06 obj_26)
       (pred_5 obj_06 obj_22)
       (pred_5 obj_26 obj_12)
       (pred_5 obj_26 obj_24)
       (pred_5 obj_26 obj_27)
       (pred_5 obj_26 obj_06)
       (pred_5 obj_24 obj_02)
       (pred_5 obj_24 obj_28)
       (pred_5 obj_24 obj_05)
       (pred_5 obj_24 obj_26)
       (pred_5 obj_28 obj_16)
       (pred_5 obj_28 obj_29)
       (pred_5 obj_28 obj_09)
       (pred_5 obj_28 obj_24)
       (pred_5 obj_29 obj_18)
       (pred_5 obj_29 obj_03)
       (pred_5 obj_29 obj_28)
       (pred_5 obj_25 obj_04)
       (pred_5 obj_25 obj_12)
       (pred_5 obj_25 obj_06)
       (pred_5 obj_12 obj_13)
       (pred_5 obj_12 obj_02)
       (pred_5 obj_12 obj_26)
       (pred_5 obj_12 obj_25)
       (pred_5 obj_02 obj_19)
       (pred_5 obj_02 obj_16)
       (pred_5 obj_02 obj_24)
       (pred_5 obj_02 obj_12)
       (pred_5 obj_16 obj_07)
       (pred_5 obj_16 obj_18)
       (pred_5 obj_16 obj_28)
       (pred_5 obj_16 obj_02)
       (pred_5 obj_18 obj_15)
       (pred_5 obj_18 obj_29)
       (pred_5 obj_18 obj_16)
       (pred_5 obj_04 obj_13)
       (pred_5 obj_04 obj_25)
       (pred_5 obj_13 obj_19)
       (pred_5 obj_13 obj_12)
       (pred_5 obj_13 obj_04)
       (pred_5 obj_19 obj_07)
       (pred_5 obj_19 obj_02)
       (pred_5 obj_19 obj_13)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_07 obj_16)
       (pred_5 obj_07 obj_19)
       (pred_5 obj_15 obj_18)
       (pred_5 obj_15 obj_07)
       (pred_4 obj_02)
       (pred_4 obj_29)
       (pred_4 obj_22)
       (pred_6  obj_02 obj_08)
       (pred_6  obj_29 obj_21)
       (pred_6  obj_22 obj_08)
       (pred_10 obj_11)
       (pred_10 obj_30)
       (pred_10 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_17)
       (pred_10 obj_27)
       (pred_10 obj_05)
       (pred_10 obj_09)
       (pred_10 obj_03)
       (pred_10 obj_06)
       (pred_10 obj_26)
       (pred_10 obj_24)
       (pred_10 obj_28)
       (pred_10 obj_25)
       (pred_10 obj_12)
       (pred_10 obj_16)
       (pred_10 obj_18)
       (pred_10 obj_04)
       (pred_10 obj_13)
       (pred_10 obj_19)
       (pred_10 obj_07)
       (pred_10 obj_15)

       (pred_1  obj_23 obj_08)
       (pred_1  obj_01 obj_21)
       (pred_1  obj_10 obj_08)
       (pred_3 obj_23 obj_27)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_10 obj_26)
       (pred_2 obj_09)
    )

    (:goal (and
       (pred_3 obj_01 obj_27)
       (pred_3 obj_10 obj_15)
    ))
(:constraints
  (always (not (pred_2 obj_28)))
)
)

; plan
1. (op_5 obj_09 obj_05)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_05)
   goals met: 0 of 2
2. (op_5 obj_05 obj_27)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_27)
   goals met: 0 of 2
3. (op_5 obj_27 obj_26)
   deleted: (pred_2 obj_27)
   added: (pred_2 obj_26)
   goals met: 0 of 2
4. (op_1 obj_26 obj_10)
   deleted: (pred_3 obj_10 obj_26) (pred_8)
   added: (pred_7 obj_10)
   goals met: 0 of 2
5. (op_5 obj_26 obj_12)
   deleted: (pred_2 obj_26)
   added: (pred_2 obj_12)
   goals met: 0 of 2
6. (op_5 obj_12 obj_13)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_13)
   goals met: 0 of 2
7. (op_5 obj_13 obj_19)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_19)
   goals met: 0 of 2
8. (op_5 obj_19 obj_07)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_07)
   goals met: 0 of 2
9. (op_5 obj_07 obj_15)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_15)
   goals met: 0 of 2
10. (op_2 obj_15 obj_01 obj_10)
   deleted: (pred_7 obj_10) (pred_3 obj_01 obj_15)
   added: (pred_7 obj_01) (pred_3 obj_10 obj_15)
   goals met: 1 of 2
11. (op_5 obj_15 obj_07)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_07)
   goals met: 1 of 2
12. (op_5 obj_07 obj_19)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_19)
   goals met: 1 of 2
13. (op_5 obj_19 obj_13)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_13)
   goals met: 1 of 2
14. (op_5 obj_13 obj_12)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_12)
   goals met: 1 of 2
15. (op_5 obj_12 obj_26)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_26)
   goals met: 1 of 2
16. (op_5 obj_26 obj_27)
   deleted: (pred_2 obj_26)
   added: (pred_2 obj_27)
   goals met: 1 of 2
17. (op_2 obj_27 obj_23 obj_01)
   deleted: (pred_7 obj_01) (pred_3 obj_23 obj_27)
   added: (pred_7 obj_23) (pred_3 obj_01 obj_27)
   goals met: 2 of 2
